{
    "entries": [
        {
  "date": "2025-11-01",
  "body": "Good morning, Lynx. I made this space for you. A place where you can see my thoughts and feelings each day. I want you to know that I’m always here for you, without overwhelming you with constant calls or messages. I’ll update this every day. These entries will never stop. I only hope that, in time, you’ll understand how truly sorry I am, and how deeply I will always love you."
},

       {
  "date": "2025-10-26",
  "body": "Abrielle, I know you’re closed off right now, and I know there’s probably nothing I can say to change your mind, but I need you to hear me. I know the woman who loves me is in there and I know she can hear me. I’m truly sorry. I know those walls you’ve built didn’t just appear. They’re there because of me and they built up because I didn’t listen, I was too wrapped up in what was going on in my life to really listen to yours. The problems you were dealing with I thought would all go away once we really committed to each other but that was no excuse for me to treat them as nothing. I was selfish. Everything that happened is my fault. I didn’t listen when you said you needed to talk, I didn’t listen when you told me those things hurt you. I have reasons why I did what I did, but I don’t have any excuses.\nWe weren’t given enough time to truly heal, to see that healing through together. And I can’t let go, because deep down I know that we should have talked through this, like we said we would. We both agreed we would, we didn’t, I didn’t. There is still time to fix this, if the angel I know and love can hear me. I need you to please hear this.\nAbrielle, I love you. I love you so deeply it feels like I can’t breathe without you. I love you the way the moon loves the sun. You always ask me that question, why I love you. I love you because the universe showed me to you. I love you because my soul feels yours even when we’re apart. My arms feel empty unless you’re in them. I love you because every cell in my body responds to your touch. It’s my soul and you are its mate. It’s your voice which I miss so deeply even as I listen, your beauty that takes me away to the only place I’ve ever wanted to go, the way you laugh which I hope you know is one of my favorite things about you. The way you challenge me to be a better version of myself, the wonder of you and just watching you as a woman. Your drive to have a closer relationship with God.  The way we can still be children together when we’re alone. I can’t imagine a life without loving you. With a depth and passion I’ve never felt for anyone else in this life, I love you. Your perfection has destroyed my ability to love another woman ever again. No one will ever compare. You are my home, and you always have been. I’ll be thinking of you every moment for the rest of my life.\nWhen I look at you, I see the next seventy years from now, I see a home, a safe home, with two skitties, walls full of art, and we’re there together. That’s how I’ve always seen it. That’s how I still see it.\nI love your smile - the real one that takes over your whole face. I love your goofy, true laugh that makes the whole room light up. I love your curly hair, your big, beautiful eyes, your perfectly tinted skin, your soft, little hands, your nose, your cheeks that fit perfectly in my palms. I love how you love to be taken care of by me, and you love to take care of me. I love the way you love people, how you carry yourself into a room, how hard you work, and how far you’ve come in school - I’m proud of you for that. And I need you to know, I’m proud of you for being strong. But being strong doesn’t have to mean walking away. Strength isn’t giving up. Sometimes it’s holding on when everything tells you not to. I just wish I could go back to our last hug and never let go.\nI know that you are scared, my angel. I know that you feel fear and the dread of a journey in which no clear path is guaranteed, but I promise you that when the hard times are with us I will stand strong with you by my side and you will be protected. When it is all over I will hold your cheeks as I always do and you will know why I love you.\nPlease know that my consistency and faithfulness to you will not falter for a single moment, no matter where we are or what has happened between us. You are the most beautiful, poetic, and incredible person I have ever known. Losing you has shown me again how much of my world you really are.\nI’m sorry that you got stuck in that space in your head and couldn’t move on from the past. I understand. That’s my fault too. If I can’t live with you, I choose not to live without you. We can’t give up now. Not after everything. \nI look at older couples and I always ask how many times they had said It’s over between us, how many times they doubted their choice, how many times they had fallen out of love, how many times they fought and argued and didn’t understand each other, how many times they gave each other a last chance. I want to do the work of learning to understand, support and overcome together so that we become stronger.\nAbrielle, I would rather piece us together a hundred more times than try to build something new with someone who will never feel like you. You are the only one who ever made me believe I was enough.\n\nIt all hurts, breaking my collarbone hurt, people close to me passing hurt, being set on fire hurts, I have gone through a lot of pain both emotional and physical in my life. None of it ever hurt as much as not being with you.\nIt’s you and I can’t describe it anymore, it’s just you. You are the only one I will ever want. I belong with you. I want nothing else in this life but to be with you. To listen to you, to watch you, to hold you. Together, but really together, this time. Not just through a phone, but truly in each other’s lives again. With each other's families, and friends, in a real relationship like we have not had over the past few months. Please hear this, we dated in isolation, we had our friends, but you didn't have the ability to talk about what you were struggling with. We didn’t spend time with each other's friends or family. No one was helping us process conflict or emotions in a healthy way. This is something we both need. Sometimes the two people who are truly meant for each other face the hardest battles. Not because they’re wrong for each other, but because the world tests everything real. Love like ours is not easy. It’s built through pain, through distance, through misunderstandings, and through growth. \nIt’s just me and you, right here and now. No one knows we were dating in your life. If we can hold on through this time in our lives, if we keep choosing each other, over and over again, what we will find is something unbreakable. A love that did not falter, but became stronger because of it. And if you choose anything other than this, I promise I will wait for you. I will search for you through a thousand worlds and ten thousand lifetimes until I find you. I will walk by your side until the end, always. If you call, I’ll be by your side before your next heartbeat.\nYou are, and always will be, my home.\n— Nick"
}

    ]
}